---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.GenericFailures
source: html/dbd9cb9b-fde2-b55e-c36c-e7044a266888.htm
---
# BuiltInFailures.GenericFailures Properties

There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.